MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GM706/mcu.h
/* CNENC */
#define _CNIEC0 CNENCbits.CNIEC0
#define _CNIEC1 CNENCbits.CNIEC1
#define _CNIEC2 CNENCbits.CNIEC2
#define _CNIEC3 CNENCbits.CNIEC3
#define _CNIEC4 CNENCbits.CNIEC4
#define _CNIEC5 CNENCbits.CNIEC5
#define _CNIEC6 CNENCbits.CNIEC6
#define _CNIEC7 CNENCbits.CNIEC7
#define _CNIEC8 CNENCbits.CNIEC8
#define _CNIEC9 CNENCbits.CNIEC9
#define _CNIEC10 CNENCbits.CNIEC10
#define _CNIEC11 CNENCbits.CNIEC11
#define _CNIEC12 CNENCbits.CNIEC12
#define _CNIEC13 CNENCbits.CNIEC13
#define _CNIEC15 CNENCbits.CNIEC15

/* CNPUC */
#define _CNPUC0 CNPUCbits.CNPUC0
#define _CNPUC1 CNPUCbits.CNPUC1
#define _CNPUC2 CNPUCbits.CNPUC2
#define _CNPUC3 CNPUCbits.CNPUC3
#define _CNPUC4 CNPUCbits.CNPUC4
#define _CNPUC5 CNPUCbits.CNPUC5
#define _CNPUC6 CNPUCbits.CNPUC6
#define _CNPUC7 CNPUCbits.CNPUC7
#define _CNPUC8 CNPUCbits.CNPUC8
#define _CNPUC9 CNPUCbits.CNPUC9
#define _CNPUC10 CNPUCbits.CNPUC10
#define _CNPUC11 CNPUCbits.CNPUC11
#define _CNPUC12 CNPUCbits.CNPUC12
#define _CNPUC13 CNPUCbits.CNPUC13
#define _CNPUC15 CNPUCbits.CNPUC15

/* CNPDC */
#define _CNPDC0 CNPDCbits.CNPDC0
#define _CNPDC1 CNPDCbits.CNPDC1
#define _CNPDC2 CNPDCbits.CNPDC2
#define _CNPDC3 CNPDCbits.CNPDC3
#define _CNPDC4 CNPDCbits.CNPDC4
#define _CNPDC5 CNPDCbits.CNPDC5
#define _CNPDC6 CNPDCbits.CNPDC6
#define _CNPDC7 CNPDCbits.CNPDC7
#define _CNPDC8 CNPDCbits.CNPDC8
#define _CNPDC9 CNPDCbits.CNPDC9
#define _CNPDC10 CNPDCbits.CNPDC10
#define _CNPDC11 CNPDCbits.CNPDC11
#define _CNPDC12 CNPDCbits.CNPDC12
#define _CNPDC13 CNPDCbits.CNPDC13
#define _CNPDC15 CNPDCbits.CNPDC15

/* ANSELC */
#define _ANSC0 ANSELCbits.ANSC0
#define _ANSC1 ANSELCbits.ANSC1
#define _ANSC2 ANSELCbits.ANSC2
#define _ANSC3 ANSELCbits.ANSC3
#define _ANSC4 ANSELCbits.ANSC4
#define _ANSC5 ANSELCbits.ANSC5
#define _ANSC10 ANSELCbits.ANSC10
#define _ANSC11 ANSELCbits.ANSC11
#define _ANSC12 ANSELCbits.ANSC12

/* TRISD */
#define _TRISD5 TRISDbits.TRISD5
#define _TRISD6 TRISDbits.TRISD6
#define _TRISD8 TRISDbits.TRISD8

/* PORTD */
#define _RD5 PORTDbits.RD5
#define _RD6 PORTDbits.RD6
#define _RD8 PORTDbits.RD8

/* LATD */
#define _LATD5 LATDbits.LATD5
#define _LATD6 LATDbits.LATD6
#define _LATD8 LATDbits.LATD8

/* ODCD */
#define _ODCD5 ODCDbits.ODCD5
#define _ODCD6 ODCDbits.ODCD6
#define _ODCD8 ODCDbits.ODCD8

/* CNEND */
#define _CNIED5 CNENDbits.CNIED5
#define _CNIED6 CNENDbits.CNIED6
#define _CNIED8 CNENDbits.CNIED8

/* CNPUD */
#define _CNPUD5 CNPUDbits.CNPUD5
#define _CNPUD6 CNPUDbits.CNPUD6
#define _CNPUD8 CNPUDbits.CNPUD8

/* CNPDD */
#define _CNPDD5 CNPDDbits.CNPDD5
#define _CNPDD6 CNPDDbits.CNPDD6
#define _CNPDD8 CNPDDbits.CNPDD8

/* TRISE */
#define _TRISE12 TRISEbits.TRISE12
#define _TRISE13 TRISEbits.TRISE13
#define _TRISE14 TRISEbits.TRISE14
#define _TRISE15 TRISEbits.TRISE15

/* PORTE */
#define _RE12 PORTEbits.RE12
#define _RE13 PORTEbits.RE13
#define _RE14 PORTEbits.RE14
#define _RE15 PORTEbits.RE15

/* LATE */
#define _LATE12 LATEbits.LATE12
#define _LATE13 LATEbits.LATE13
#define _LATE14 LATEbits.LATE14
#define _LATE15 LATEbits.LATE15

/* ODCE */
#define _ODCE12 ODCEbits.ODCE12
#define _ODCE13 ODCEbits.ODCE13
#define _ODCE14 ODCEbits.ODCE14
#define _ODCE15 ODCEbits.ODCE15

/* CNENE */
#define _CNIEE12 CNENEbits.CNIEE12
#define _CNIEE13 CNENEbits.CNIEE13
#define _CNIEE14 CNENEbits.CNIEE14
#define _CNIEE15 CNENEbits.CNIEE15

/* CNPUE */
#define _CNPUE12 CNPUEbits.CNPUE12
#define _CNPUE13 CNPUEbits.CNPUE13
#define _CNPUE14 CNPUEbits.CNPUE14
#define _CNPUE15 CNPUEbits.CNPUE15

/* CNPDE */
#define _CNPDE12 CNPDEbits.CNPDE12
#define _CNPDE13 CNPDEbits.CNPDE13
#define _CNPDE14 CNPDEbits.CNPDE14
#define _CNPDE15 CNPDEbits.CNPDE15

/* ANSELE */
#define _ANSE12 ANSELEbits.ANSE12
#define _ANSE13 ANSELEbits.ANSE13
#define _ANSE14 ANSELEbits.ANSE14
#define _ANSE15 ANSELEbits.ANSE15

/* TRISF */
#define _TRISF0 TRISFbits.TRISF0
#define _TRISF1 TRISFbits.TRISF1

/* PORTF */
#define _RF0 PORTFbits.RF0
#define _RF1 PORTFbits.RF1

/* LATF */
#define _LATF0 LATFbits.LATF0
#define _LATF1 LATFbits.LATF1

/* ODCF */
#define _ODCF0 ODCFbits.ODCF0
#define _ODCF1 ODCFbits.ODCF1

/* CNENF */
#define _CNIEF0 CNENFbits.CNIEF0
#define _CNIEF1 CNENFbits.CNIEF1

/* CNPUF */
#define _CNPUF0 CNPUFbits.CNPUF0
#define _CNPUF1 CNPUFbits.CNPUF1

/* CNPDF */
#define _CNPDF0 CNPDFbits.CNPDF0
#define _CNPDF1 CNPDFbits.CNPDF1

/* TRISG */
#define _TRISG6 TRISGbits.TRISG6
#define _TRISG7 TRISGbits.TRISG7
#define _TRISG8 TRISGbits.TRISG8
#define _TRISG9 TRISGbits.TRISG9

/* PORTG */
#define _RG6 PORTGbits.RG6
#define _RG7 PORTGbits.RG7
#define _RG8 PORTGbits.RG8
#define _RG9 PORTGbits.RG9

/* LATG */
#define _LATG6 LATGbits.LATG6
#define _LATG7 LATGbits.LATG7
#define _LATG8 LATGbits.LATG8
#define _LATG9 LATGbits.LATG9

/* ODCG */
#define _ODCG6 ODCGbits.ODCG6
#define _ODCG7 ODCGbits.ODCG7
#define _ODCG8 ODCGbits.ODCG8
#define _ODCG9 ODCGbits.ODCG9

/* CNENG */
#define _CNIEG6 CNENGbits.CNIEG6
#define _CNIEG7 CNENGbits.CNIEG7
#define _CNIEG8 CNENGbits.CNIEG8
#define _CNIEG9 CNENGbits.CNIEG9

/* CNPUG */
#define _CNPUG6 CNPUGbits.CNPUG6
#define _CNPUG7 CNPUGbits.CNPUG7
#define _CNPUG8 CNPUGbits.CNPUG8
#define _CNPUG9 CNPUGbits.CNPUG9

/* CNPDG */
#define _CNPDG6 CNPDGbits.CNPDG6
#define _CNPDG7 CNPDGbits.CNPDG7
#define _CNPDG8 CNPDGbits.CNPDG8
#define _CNPDG9 CNPDGbits.CNPDG9

/* ANSELG */
#define _ANSG6 ANSELGbits.ANSG6
#define _ANSG7 ANSELGbits.ANSG7
#define _ANSG8 ANSELGbits.ANSG8
#define _ANSG9 ANSELGbits.ANSG9

/* PADCFG1 */
#define _PMPTTL PADCFG1bits.PMPTTL
#define _RTSECSEL PADCFG1bits.RTSECSEL

/* APPS */
#define _APIFUL APPSbits.APIFUL
#define _APIOV APPSbits.APIOV
#define _AROFUL APPSbits.AROFUL
#define _APOOV APPSbits.APOOV
#define _STRFUL APPSbits.STRFUL


/*----------------------------------------------------------- */
/* Some useful macros for allocating data memory              */
/*----------------------------------------------------------- */

/* The following macros require an argument N that specifies  */
/* alignment. N must a power of two, minimum value = 2.       */
/* For example, to declare an uninitialized array in X memory */
/* that is aligned to a 32 byte address:                      */
/*                                                            */
/* int _XBSS(32) xbuf[16];                                    */
/*                                                            */
#define _XBSS(N)    __attribute__((space(xmemory),far,aligned(N)))
#define _XDATA(N)   __attribute__((space(xmemory),far,aligned(N)))
#define _YBSS(N)    __attribute__((space(ymemory),far,aligned(N)))
#define _YDATA(N)   __attribute__((space(ymemory),far,aligned(N)))

/* The following macros do not require an argument. They can  */
/* be used to locate a variable in persistent data memory or  */
/* in near data memory. For example, to declare two variables */
/* that retain their values across a device reset:            */
/*                                                            */
/* int _PERSISTENT var1,var2;                                 */
/*                                                            */
#define _PERSISTENT __attribute__((persistent))
#define _NEAR       __attribute__((near))

/* ---------------------------------------------------------- */
/* Some useful macros for declaring functions                 */
/* ---------------------------------------------------------- */

/* The following macros can be used to declare interrupt      */
/* service routines (ISRs). For example, to declare an ISR    */
/* for the timer1 interrupt:                                  */
/*                                                            */
/* void _ISR _T1Interrupt(void);                              */
/*                                                            */
/* To declare an ISR for the SPI1 interrupt with fast         */
/* context save:                                              */
/*                                                            */
/* void _ISRFAST _SPI1Interrupt(void);                        */
/*                                                            */
/* Note: ISRs will be installed into the interrupt vector     */
/* tables automatically if the reserved names listed in the   */
/* MPLAB C30 Compiler User's Guide (DS51284) are used.        */
/*                                                            */
#define _ISR __attribute__((interrupt))
#define _ISRFAST __attribute__((interrupt, shadow))

/* ---------------------------------------------------------- */
/* Some useful macros for changing the CPU IPL                */
/* ---------------------------------------------------------- */

